# Pandas
It has two gypes of structures
1. series  (one column)
2. DataFrame   (more than 1>1)

In [2]:
import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings('ignore')       # For ignore warnings bascially not for use

In [3]:
ser=pd.Series()                 # creating series
ser

Series([], dtype: float64)

In [4]:
ser=pd.Series([0,10,20,30,40,50,60])         # passing list of data to series
ser          # index postion is also reflect with data

0     0
1    10
2    20
3    30
4    40
5    50
6    60
dtype: int64

In [6]:
ser=pd.Series([20,15.7,'10'])      # int,float and string values given 
ser      # data converted into object type

0      20
1    15.7
2      10
dtype: object

In [7]:
der={'a':[1,5,3],'b':[4,6,7],'c':[9,2,8]}    #creating dictonary

In [8]:
df=pd.DataFrame(der)     #creating dataframe

In [10]:
df    # table created with index psotion

   a  b  c
0  1  4  9
1  5  6  2
2  3  7  8

In [12]:
# Adding new column and values into it
df['d']=" One Two Ten".split()     #.split() for divide data by space by default
df

   a  b  c    d
0  1  4  9  One
1  5  6  2  Two
2  3  7  8  Ten

In [13]:
df['e']=[10,25,30]    # passing data as list
df

   a  b  c    d   e
0  1  4  9  One  10
1  5  6  2  Two  25
2  3  7  8  Ten  30

In [15]:
# Create NaN values and its manipulation
dict={'a':[1,2,np.nan],'b':[5,np.nan,np.nan],'c':[1,2,3],'d':[6,7,8]}

In [16]:
df=pd.DataFrame(dict)
df

     a    b  c  d
0  1.0  5.0  1  6
1  2.0  NaN  2  7
2  NaN  NaN  3  8

In [18]:
# To drop and remove NaN values by two ways 1. from column 2. from row
print(df.dropna(axis=1))    # axis=1 is column

   c  d
0  1  6
1  2  7
2  3  8

In [20]:
print(df.dropna(axis=0))     # axis=0 is row

     a    b  c  d
0  1.0  5.0  1  6

In [21]:
# To fill NaN values
print(df.fillna(value=25))   # passing vallues to fill nan (nan replaced by 25)

      a     b  c  d
0   1.0   5.0  1  6
1   2.0  25.0  2  7
2  25.0  25.0  3  8

In [22]:
df

     a    b  c  d
0  1.0  5.0  1  6
1  2.0  NaN  2  7
2  NaN  NaN  3  8

In [23]:
df.fillna(value=df['c'].mean(),inplace=True)   #inplace=True to save cahnges otherwise by default it is false doesn't save.
df

     a    b  c  d
0  1.0  5.0  1  6
1  2.0  2.0  2  7
2  2.0  2.0  3  8

In [24]:
# Create DataFrame=
data={'Company':['GOGL','GOGL','DB','DB','FB','FB'],'Person':['Akki','Nishant','Annu','Nunu','Robin','Doli'],
       'Sales':[200,120,340,129,243,350],'Profit':[40,24,15,35,16,55]}
df=pd.DataFrame(data)
df

  Company   Person  Sales  Profit
0    GOGL     Akki    200      40
1    GOGL  Nishant    120      24
2      DB     Annu    340      15
3      DB     Nunu    129      35
4      FB    Robin    243      16
5      FB     Doli    350      55

# Group by
means it used to group or combine data present multiple time and show its details that we wanted of it.

In [25]:
# Taking mean of sales
avg_sales=df.groupby('Company',as_index=False)['Sales'].mean()   #index=false to show index
print('\n Group by company mean of sales \n','-'*50)
print(avg_sales)

 Group by company mean of sales
 --------------------------------------------------
  Company  Sales
0      DB  234.5
1      FB  296.5
2    GOGL  160.0

In [28]:
# Taking sum of prfit and sales together
total_sales=df.groupby('Company')['Sales','Profit'].sum()   
print('\n Group by company sum of sales and profit \n','-'*50)
print(total_sales)

 Group by company sum of sales and profit
 --------------------------------------------------
         Sales  Profit
Company
DB         469      50
FB         593      71
GOGL       320      64

In [30]:
#Taking stats means both sum and mean of both sales and profit
Sales_stats=df.groupby('Company')['Sales','Profit'].agg(['mean','sum'])   
print('\n Group by company sum and mean of both sales and profit together \n','-'*50)
print(Sales_stats)

 Group by company sum and mean of both sales and profit together
 --------------------------------------------------
         Sales      Profit
          mean  sum   mean sum
Company
DB       234.5  469   25.0  50
FB       296.5  593   35.5  71
GOGL     160.0  320   32.0  64

In [31]:
# Taking out largest and samllest number of sales
df.groupby('Company')['Sales'].nlargest(1)     # nlargest for taking out largest sale company and 1 is top 1

Company
DB       2    340
FB       5    350
GOGL     0    200
Name: Sales, dtype: int64

In [32]:
df.groupby('Company')['Sales'].nlargest(2)

Company
DB       2    340
         3    129
FB       5    350
         4    243
GOGL     0    200
         1    120
Name: Sales, dtype: int64

In [33]:
df.groupby('Company')['Sales'].nsmallest(1)     # for sn=mallest

Company
DB       3    129
FB       4    243
GOGL     1    120
Name: Sales, dtype: int64

# Combining DataFrame
There are three ways -
1. Concat (combine multiple data frames)
2. Merge  (combine only two data frames)
3. Join   (based on matching indexes)

### Concating(concat)

In [11]:
import pandas as pd
import numpy as np

In [12]:
Class_a=pd.DataFrame({'Mat':[45,65,75,55],
                      'Eng':[74,84,54,64],
                      'Sci':[53,73,83,95],
                      'Chem':[28,38,58,48]},
                      index=['Ravi','Rahul','Rajiv','Rohan'])
Class_a

       Mat  Eng  Sci  Chem
Ravi    45   74   53    28
Rahul   65   84   73    38
Rajiv   75   54   83    58
Rohan   55   64   95    48

In [13]:
Class_b=pd.DataFrame({'Mat':[48,65,77,25],
                      'Eng':[34,83,54,54],
                      'Sci':[83,33,83,95],
                      'Chem':[28,88,68,48]},
                      index=['Bhanu','Bahul','Bhajiv','Bohan'])
Class_b

        Mat  Eng  Sci  Chem
Bhanu    48   34   83    28
Bahul    65   83   33    88
Bhajiv   77   54   83    68
Bohan    25   54   95    48

In [14]:
Class_c=pd.DataFrame({'Mat':[43,55,15,55],
                      'Eng':[74,84,24,64],
                      'Sci':[53,71,23,95],
                      'Chem':[28,38,68,98]},
                      index=['Cavi','Cahul','Cajiv','Cohan'])
Class_c

       Mat  Eng  Sci  Chem
Cavi    43   74   53    28
Cahul   55   84   71    38
Cajiv   15   24   23    68
Cohan   55   64   95    98

In [15]:
All_student=pd.concat([Class_a,Class_b,Class_c],axis=0)    #axis=0 becuse three data have common name columns
print("\n After Concatin \n",'-'*30)
print(All_student)    #all data will be merged in single data frame

 After Concatin
 ------------------------------
        Mat  Eng  Sci  Chem
Ravi     45   74   53    28
Rahul    65   84   73    38
Rajiv    75   54   83    58
Rohan    55   64   95    48
Bhanu    48   34   83    28
Bahul    65   83   33    88
Bhajiv   77   54   83    68
Bohan    25   54   95    48
Cavi     43   74   53    28
Cahul    55   84   71    38
Cajiv    15   24   23    68
Cohan    55   64   95    98

### Merge
Only combine two data frame greater than 2 it will fail.
It will display common data.Try to find common connection between two dataframes this help in building connection

In [16]:
player_id_name=pd.DataFrame({'ID':[25,33,35,40,45,50,55],
                             'Name':['Akki','Diggi','Rikki','Chikki','Abhi','Rishi','Pinki']})
print("\n player id and name \n ============")
print(player_id_name)

 player id and name
 ============
   ID    Name
0  25    Akki
1  33   Diggi
2  35   Rikki
3  40  Chikki
4  45    Abhi
5  50   Rishi
6  55   Pinki

In [17]:
player_details=pd.DataFrame({'ID':[25,33,45,50,55],
                             'Age':[25,35,18,19,21],
                             'Country':['India','Russia','China','Bhutan','Nepal']})
print("\n player details \n ============")
print(player_details)

 player details
 ============
   ID  Age Country
0  25   25   India
1  33   35  Russia
2  45   18   China
3  50   19  Bhutan
4  55   21   Nepal

In [18]:
print(" Data will be merged based on ID")
pd.merge(player_id_name,player_details, on='ID')   #on=ID because id column is common in both and have some similar entries

 Data will be merged based on ID

   ID   Name  Age Country
0  25   Akki   25   India
1  33  Diggi   35  Russia
2  45   Abhi   18   China
3  50  Rishi   19  Bhutan
4  55  Pinki   21   Nepal

### Join

In [19]:
left=pd.DataFrame({'A':['A0','A1','A2'],
                   'B':['B0','B1','B2']},
                   index=['K0','K1','K2'])
right=pd.DataFrame({'C':['C0','C1','C2'],
                    'D':['D0','D1','D2']},
                    index=['K0','K2','K3'])

In [20]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [21]:
right

     C   D
K0  C0  D0
K2  C1  D1
K3  C2  D2

In [22]:
left.join(right)    # joining right to left means whole data of left and similar index data of right will appear

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [23]:
left.join(right, how='outer')   #how=outer means show or print everthing

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

# apply functions

In [48]:
df=pd.DataFrame({'Dept':[1,2,3,4,5,6,7,8,9,10],
                 'Emp_name':['AkKi','Rikki','Diggi','Rishi','Pinki','Chinki','Lucki','Rinki','Tinki','Kuchi'],
                 'Salary':[10000,9000,8000,7000,6000,11000,12000,13000,14000,15000]})
df

   Dept Emp_name  Salary
0     1     AkKi   10000
1     2    Rikki    9000
2     3    Diggi    8000
3     4    Rishi    7000
4     5    Pinki    6000
5     6   Chinki   11000
6     7    Lucki   12000
7     8    Rinki   13000
8     9    Tinki   14000
9    10    Kuchi   15000

In [49]:
#define function
def salary_hike(x):
    if (x>10000):
        return np.ceil(x+(x*0.5))
    else:
        return np.ceil(x*1.5)

In [50]:
#adding new column New Salary
df['New_salary']=df['Salary'].apply(salary_hike)
df

   Dept Emp_name  Salary  New_salary
0     1     AkKi   10000     15000.0
1     2    Rikki    9000     13500.0
2     3    Diggi    8000     12000.0
3     4    Rishi    7000     10500.0
4     5    Pinki    6000      9000.0
5     6   Chinki   11000     16500.0
6     7    Lucki   12000     18000.0
7     8    Rinki   13000     19500.0
8     9    Tinki   14000     21000.0
9    10    Kuchi   15000     22500.0

In [51]:
#Adding one more column Increased salary
df['Increased_salary']=df['New_salary']-df['Salary']
df

   Dept Emp_name  Salary  New_salary  Increased_salary
0     1     AkKi   10000     15000.0            5000.0
1     2    Rikki    9000     13500.0            4500.0
2     3    Diggi    8000     12000.0            4000.0
3     4    Rishi    7000     10500.0            3500.0
4     5    Pinki    6000      9000.0            3000.0
5     6   Chinki   11000     16500.0            5500.0
6     7    Lucki   12000     18000.0            6000.0
7     8    Rinki   13000     19500.0            6500.0
8     9    Tinki   14000     21000.0            7000.0
9    10    Kuchi   15000     22500.0            7500.0

In [52]:
#For total of New Salary
print(df['New_salary'].sum())

157500.0

In [53]:
# for min and max salary
print(df['New_salary'].min(),"and",df['New_salary'].max())

9000.0 and 22500.0

In [54]:
# Deletion and sorting
print(df.columns)   # columns names with data type printed

Index(['Dept', 'Emp_name', 'Salary', 'New_salary', 'Increased_salary'], dtype='object')

In [55]:
l=list(df.columns)
l                     # only columns name will print after converted to list

['Dept', 'Emp_name', 'Salary', 'New_salary', 'Increased_salary']

In [56]:
df.drop('Salary',axis=1,inplace=True)     # fro delete column
df

   Dept Emp_name  New_salary  Increased_salary
0     1     AkKi     15000.0            5000.0
1     2    Rikki     13500.0            4500.0
2     3    Diggi     12000.0            4000.0
3     4    Rishi     10500.0            3500.0
4     5    Pinki      9000.0            3000.0
5     6   Chinki     16500.0            5500.0
6     7    Lucki     18000.0            6000.0
7     8    Rinki     19500.0            6500.0
8     9    Tinki     21000.0            7000.0
9    10    Kuchi     22500.0            7500.0

In [57]:
del df['Dept']   # del also used for deletion
df

  Emp_name  New_salary  Increased_salary
0     AkKi     15000.0            5000.0
1    Rikki     13500.0            4500.0
2    Diggi     12000.0            4000.0
3    Rishi     10500.0            3500.0
4    Pinki      9000.0            3000.0
5   Chinki     16500.0            5500.0
6    Lucki     18000.0            6000.0
7    Rinki     19500.0            6500.0
8    Tinki     21000.0            7000.0
9    Kuchi     22500.0            7500.0

In [61]:
df.sort_values(by='Increased_salary',ascending=False)     #by default ascending=True

  Emp_name  New_salary  Increased_salary
9    Kuchi     22500.0            7500.0
8    Tinki     21000.0            7000.0
7    Rinki     19500.0            6500.0
6    Lucki     18000.0            6000.0
5   Chinki     16500.0            5500.0
0     AkKi     15000.0            5000.0
1    Rikki     13500.0            4500.0
2    Diggi     12000.0            4000.0
3    Rishi     10500.0            3500.0
4    Pinki      9000.0            3000.0